Autodesk.Revit.DB.Events.DocumentSavedAsEventArgs.IsSavingAsMasterFile
Indicates whether the document is to be saved as master file.
Since:
2010

Autodesk.Revit.DB.Events.DocumentSavedAsEventArgs.OriginalPath
Original path of the document.
Since:
2010

Autodesk.Revit.DB.Events.DocumentSavedAsEventArgs
The event arguments used by the DocumentSavedAs event.
Since:
2010